
// Написать функцию, которая принимает два числа и возращает результат их умножения
// let x = prompt('Birinci ededi daxil edin')
// let y = prompt('Ikinci ededi daxil edin')

// function multiplyNumbers() {
//     alert(Number(x)*Number(y))
// // 
// multiplyNumbers()

// Написать функцию, которой передаем, имя, фамилия и возраст, и получаем строку "Привет Иван Петров с возрастом 17 лет" (только здесь данные, которые были переданы в функцию)

// let firstName = prompt('Adinizi daxil edin');
// let lastName = prompt('Soyadinizi daxil edin');
// let Age = prompt('Yasinizi daxil edin');
// alert(`Salam ${firstName} ${lastName} (${Age} yas)`)

// Написать функцию, которая принимает пол человека ('M','F') в виде строки, результат функции возвращает строку "Ваш пол мужской" (или женский) или же "Ваш пол не опеределен"

// let gender= prompt('Cinsinizi daxil edin (M/F)')
// if (gender== 'M' || gender== 'm' ){
//     alert('Sizin cinsiniz kisi')
// }
// else if(gender=='F' || gender== 'f'){
//     alert('Sizin cinsiniz qadin') 
// }
// else {
//     if (gender== ''){
//         alert('saheni bos buraxa bilmezsiniz')
//     }
//     else{
//         alert('Cinsiniz mueyyen olunmayib')
//     }
// }

// Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.
// Написать функцию, которая принимает строку (в этом тексте 3-5 предложений), верните каждое первое слово в каждом предложении, через запятую.
// Написать функцию, которой передаем имя, и она возраващает приветствие в зависимости от времени суток (Доброе утро\день\вечер\ночи Иван)
// Вывести числа от 1 до 100 в столбец. К каждой цифре подписать состояние возраста (1-17 ребенок, 18-30 - молодой, 30-55 - зрелый, от 55 - старый). Например. 33 - зрелый
// Создай новую функцию, в которую передаешь имя и возраст человека и получаешь сообщение (Иван имеет возраст 44 и он зрелый). А также вызови внутри своей функции, функцию из прошлого задания