// function alternate(s) {

//     for (let i in s) {
//         for (let j in s) {

//         }

//     }

// }
// console.log(alternate('asdcbsdcagfsdbgdfanfghbsfdab'));


// let alen = s.match(/a/g, "")
// let clen = s.match(/c/g, "")

// function fifthTask() {
//     const arrayOfNumbers = [];
//     for (let i = 5; i <= 10; i++) {
//         for (let j = 0; j < i; j++) {
//             arrayOfNumbers[i-5] = j
//         }
//     }
//     console.log(arrayOfNumbers)
// }
// fifthTask()

// С помощью двух вложенных циклов выведите на экран следующую строку:
// 111222333444555666777888999
// 11 12 13 21 22 23 31 32 33
// 111222333444555666777888999
for(let i=1;i<17;i++){
    console.log(i+'_')
}

Task 1
С помощью вложенных циклов, нарисуйте строку:

***_***_***_

где звездочкa рисуются с помощью внутреннего цикла от 0 до 3, а _ с помощью внешнего.

Task 2
С помощью вложенных циклов, нарисуйте строку:

1
*_*_*_
2
*_*_*_
3
*_*_*_
Решить задачу с помощью вложенных циклов. Внешний цикл выводит цифру и перенос строки br, внутренний - *_, и после этого внешний - знак переноса.

Task 3
С помощью вложенных циклов, нарисуйте строку:

*_*_*_
*_*_*_
*_*_*_
*_*_*_
Решить задачу с помощью вложенных циклов. Внутренний цикл выводит *_, внешний цикл выводит перенос строки br.